export const rawData1 = [
  {
    name: 'XMA1',
    实际人效: 28,
    目标人效: 32,
  },
  {
    name: 'XMA2',
    实际人效: 15,
    目标人效: 23,
  },
  {
    name: 'XMA3',
    实际人效: 38,
    目标人效: 20,
  },
  {
    name: 'XMA4',
    实际人效: 28,
    目标人效: 15,
  },

  {
    name: 'XMA5',
    实际人效: 28,
    目标人效: 10,
  },
]

export const rawData2 = [
  {
    name: '11',
    实际人效: 32,
    目标人效: 40,
  },
  {
    name: '21.12',
    实际人效: 32,
    目标人效: 40,
  },
  {
    name: '01',
    实际人效: 32,
    目标人效: 40,
  },
  {
    name: '02',
    实际人效: 32,
    目标人效: 40,
  },

  {
    name: '03',
    实际人效: 32,
    目标人效: 40,
  },

  {
    name: '04',
    实际人效: 32,
    目标人效: 40,
  },

  {
    name: '05',
    实际人效: 32,
    目标人效: 40,
  },

  {
    name: '06',
    实际人效: 32,
    目标人效: 40,
  },

  {
    name: '07',
    实际人效: 32,
    目标人效: 40,
  },

  {
    name: '08',
    实际人效: 32,
    目标人效: 40,
  },
  {
    name: '09',
    实际人效: 32,
    目标人效: 40,
  },
  {
    name: '22.10',
    实际人效: 32,
    目标人效: 40,
  },
]

export const rawData3 = [
  {
    name: '车间1',
    实际人效: 28,
    目标人效: 32,
  },
  {
    name: '车间2',
    实际人效: 15,
    目标人效: 23,
  },
  {
    name: '车间3',
    实际人效: 38,
    目标人效: 20,
  },
  {
    name: '车间4',
    实际人效: 28,
    目标人效: 15,
  },

  {
    name: '车间5',
    实际人效: 28,
    目标人效: 10,
  },
]

export const rawData4 = [
  {
    name: '产品1',
    实际人效: 28,
    目标人效: 32,
  },
  {
    name: '产品2',
    实际人效: 15,
    目标人效: 23,
  },
  {
    name: '产品3',
    实际人效: 38,
    目标人效: 20,
  },
  {
    name: '产品4',
    实际人效: 28,
    目标人效: 15,
  },

  {
    name: '产品5',
    实际人效: 28,
    目标人效: 10,
  },
]

export const rawData5 = [
  {
    name: '班组1',
    实际人效: 28,
    目标人效: 32,
  },
  {
    name: '班组2',
    实际人效: 15,
    目标人效: 23,
  },
  {
    name: '班组3',
    实际人效: 38,
    目标人效: 20,
  },
  {
    name: '班组4',
    实际人效: 28,
    目标人效: 15,
  },
  {
    name: '班组5',
    实际人效: 28,
    目标人效: 10,
  },
  {
    name: '班组6',
    实际人效: 28,
    目标人效: 32,
  },
  {
    name: '班组7',
    实际人效: 15,
    目标人效: 23,
  },
  {
    name: '班组8',
    实际人效: 38,
    目标人效: 20,
  },
  {
    name: '班组9',
    实际人效: 28,
    目标人效: 15,
  },
  {
    name: '班组10',
    实际人效: 28,
    目标人效: 10,
  },
  {
    name: '班组11',
    实际人效: 28,
    目标人效: 32,
  },
  {
    name: '班组12',
    实际人效: 15,
    目标人效: 23,
  },
  {
    name: '班组13',
    实际人效: 38,
    目标人效: 20,
  },
  {
    name: '班组14',
    实际人效: 28,
    目标人效: 15,
  },
  {
    name: '班组15',
    实际人效: 28,
    目标人效: 10,
  },
  {
    name: '班组16',
    实际人效: 28,
    目标人效: 32,
  },
  {
    name: '班组17',
    实际人效: 15,
    目标人效: 23,
  },
  {
    name: '班组18',
    实际人效: 38,
    目标人效: 20,
  },
  {
    name: '班组19',
    实际人效: 28,
    目标人效: 15,
  },
  {
    name: '班组20',
    实际人效: 28,
    目标人效: 10,
  },
]

export const dataTransformCoefficientMap1 = {
  'Kwh/h': 0.9,
  'Kwh/人': 0.8,
  '元/Kwh': 0.7,
  '人/Gwh': 0.8,
}

export const dataTransformCoefficientMap2 = {
  XMA1: 0.85,
  XMA2: 0.6,
  XMA3: 0.9,
  XMA4: 0.7,
  XMA5: 0.9,
}

export const dataTransformCoefficientMap3 = {
  班组1: 0.85,
  班组2: 0.6,
  班组3: 0.9,
  班组4: 0.7,
  班组5: 0.9,
}
